Основные_объекты_Занятие_5/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Основные_объекты_Занятие_5/src/InformationRegisters/НашиЦены/НашиЦены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НашиЦены</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Основные_объекты_Занятие_5/src/Catalogs/Валюты/Валюты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Валюты</name>
  <attributes>
    <name>БуквенныйКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКурса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Основные_объекты_Занятие_5/src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическихЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаОклада</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТрудовойСтаж</name>
    <attributes>
      <name>МестоРаботы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПриема</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаУвольнения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Основные_объекты_Занятие_5/src/CommonModules/НаСервереМожноВызватьСКлиента/Module.bsl
Функция ПолучитьНаименованиеОрганизации() Экспорт 

	Возврат Константы.НазваниеОрганизации.Получить();

КонецФункции // ПолучитьНаименованиеОрганизации()


Функция ЗаполнитьКурсВалютыНаДату(Данные) Экспорт
	
	СсылкаНаВалюту = Справочники.Валюты.НайтиПоКоду(Данные.КодВалюты);

	Если ЗначениеЗаполнено(СсылкаНаВалюту) Тогда

		ЗаписьРегистраСведений = РегистрыСведений.КурсыВалют.СоздатьМенеджерЗаписи();
		ЗаписьРегистраСведений.Период = Данные.Дата;
		ЗаписьРегистраСведений.Валюта = СсылкаНаВалюту;
		ЗаписьРегистраСведений.Курс = Данные.Курс;
		ЗаписьРегистраСведений.Кратность = ?(Данные.Кратность = 0, 1, Данные.Кратность);
		ЗаписьРегистраСведений.Ответственный = Справочники.Сотрудники.НайтиПоНаименованию(Данные.ФИО, Ложь);

		ЗаписьРегистраСведений.Записать();

		СпрВалютыОбъект = СсылкаНаВалюту.ПолучитьОбъект();
		СпрВалютыОбъект.Курс = Данные.Курс;
		СпрВалютыОбъект.Кратность = Данные.Кратность;
		СпрВалютыОбъект.ДатаКурса = Данные.Дата;
		СпрВалютыОбъект.Записать();
		
		Возврат СсылкаНаВалюту.БуквенныйКод;

	КонецЕсли;

КонецФункции


Процедура ЗаменитьОтветственного(СтарыйОтветственный, НовыйОтветственный) Экспорт 

	 Выборка = Справочники.Склады.Выбрать();
	 
	 Пока Выборка.Следующий() Цикл
	 
	 	   Если Выборка.Ответственный = СтарыйОтветственный Тогда
				 
				 СкладОбъект = Выборка.ПолучитьОбъект();
				 
				 СкладОбъект.Ответственный = НовыйОтветственный;
				 
				 СкладОбъект.Записать();
			 
			 КонецЕсли;
	 
	 КонецЦикла;

КонецПроцедуры

Функция ПолучитьСписокДолжностей(Подразделение) Экспорт
	
МассивДолжностей = Новый Массив;
	
	ТЧДолжности = Подразделение.Должности;
	
	Для Каждого ТекСтрока Из ТЧДолжности Цикл
		
		МассивДолжностей.Добавить(ТекСтрока.Должность.Наименование);
		
	КонецЦикла;
	
	Возврат МассивДолжностей;
	
КонецФункции

Функция ПолучитьСписокПредыдущихМестРаботыСотрудника(Сотрудник) Экспорт

	Массив = Новый Массив();	
	
	Для Каждого ТекСтрока Из Сотрудник.ТрудоваяКнижка Цикл
		
		Массив.Добавить(ТекСтрока.МестоРаботы);
		
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции

Функция ПолучитьСписокКонтактныхЛицКонтрагента(Контрагент) Экспорт
	
	Массив = Новый Массив();
	
	ВыборкаКонтактныеЛица = Справочники.КонтактныеЛица.Выбрать(,Контрагент);
	
	Пока ВыборкаКонтактныеЛица.Следующий() = Истина Цикл
		
		Массив.Добавить(ВыборкаКонтактныеЛица.Наименование);
		
	КонецЦикла;
	
	Возврат Массив;
	
	
КонецФункции

// Установить цену.
// 
// Параметры:
//  Параметры - Структура
// Ключи: Номенклатура, Контрагент, Цена, Дата
Процедура УстановитьЦену(Параметры) Экспорт
	
	ЗаписьРегистраСведений = РегистрыСведений.НашиЦены.СоздатьМенеджерЗаписи();
	ЗаписьРегистраСведений.Период = Параметры.Дата;
	ЗаписьРегистраСведений.Номенклатура = Параметры.Номенклатура;
	ЗаписьРегистраСведений.Контрагент = Параметры.Контрагент;
	ЗаписьРегистраСведений.Цена = Параметры.Цена;

	ЗаписьРегистраСведений.Записать();
	
КонецПроцедуры
